* Jacqueline Sanchez (PSID: 2053737, cn.user: Jsanch87) 
* June 4, 2024
* COSC 3337 | Summer 2024
* Practice Assignment 2

## Intro to Pandas
* Importing data
* Data Structures
* Operations for manipulating numericla tables and time series.

In [1]:
import pandas as pd
import numpy as np

## Series

A Series is a one-dimensional labeled array. What this mean is that we can now access (index) elements in this array using some assigned labels. We create a Series using **pd.Series(data, index)**, where data is our array and index is the corresponding labels. <br>
Lets see an example below:

In [2]:
my_series = pd.Series(data = [1,2,3], index = ['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
my_series2 = pd.Series(data = [10,20,30], index = ["Apple", "Bluberry", "Carrots"])
print(my_series2)
print(type(my_series2))

Apple       10
Bluberry    20
Carrots     30
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
my_series3 = pd.Series(data = [.50, .75, 1.15], index = ["blueberry muffin", "carrot cake", "pumpkin spice loaf"])
print(my_series3)
print(type(my_series3))

blueberry muffin      0.50
carrot cake           0.75
pumpkin spice loaf    1.15
dtype: float64
<class 'pandas.core.series.Series'>

Since **my_series** is of type Series, we can now access the first element in the array in two ways. The ususal way we access array elements: **my_series[0]**, and an additional way using the index labels we assigned: **my_series['A']**. Try accessing all of the arrays elements using borht methods. See the example below.

In [5]:
print(f"Accessing first element using my_series.iloc[0]: {my_series.iloc[0]}")
print(f"Accessing first element using my_series['A']: {my_series['A']}")

Accessing first element using my_series.iloc[0]: 1
Accessing first element using my_series['A']: 1

In [6]:
print(f"Accessing first element using my_series.iloc[10]: {my_series.iloc[0]}")
print(f"Accessing first element using my_series['C']: {my_series['A']}")

Accessing first element using my_series.iloc[10]: 1
Accessing first element using my_series['C']: 1

Note that **data*** can passed as: 
* A Python list (like we saw above) 
* A NumPy array 
* A Python dictionary

Here's an example of how we would a dictionary to **data**. Since dictionarys already come with key value paris, there's no need for us to pass index labels.

In [7]:
my_series = pd.Series(data = {'A': 1, 'B': 2, 'C': 3})
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

And here's a Numpy array example:

In [8]:
my_series = pd.Series(data = np.array([1, 2, 3]), index = ['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

**Note: if index labels are not specified for a Series, they will default to [0,n) where n is the number of data values we have. 
<br>
For example:**

In [9]:
my_series = pd.Series(pd.Series(data = [10, 20, 30]))
print(my_series)
print(type(my_series))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

What's really cool about Series is that we can perform operations on them, which will be done based off of the index. For example, let's say that I have two Series: **week_one** and **week_two**, both representing how much money I owe my employees for each week.

In [10]:
week_one = pd.Series(data = [100, 50, 300], index = ['Bob', 'Sally', 'Jess'])
week_one

Bob      100
Sally     50
Jess     300
dtype: int64

In [11]:
week_two = pd.Series(data = [500, 30, 20], index = ['Bob', 'Sally', 'Jess'])
week_two

Bob      500
Sally     30
Jess      20
dtype: int64

In [12]:
week_three = pd.Series(data = [10, 20, 30], index = ['Wednesday', 'Gomez', 'Morticia'])
week_three

Wednesday    10
Gomez        20
Morticia     30
dtype: int64

We can then sum these two Series together to get a new Series **total_due** representing the total amountthat we owe each person for the two weeks.

In [13]:
total_due = week_one + week_two
total_due

Bob      600
Sally     80
Jess     320
dtype: int64

What if we try adding different size Series?

In [14]:
week_four = pd.Series(data = [100, 200, 300, 400], index = ['Sally', 'Jack', 'Zero', 'Victor'])
week_four

Sally     100
Jack      200
Zero      300
Victor    400
dtype: int64

In [15]:
new_total_due = week_three + week_four
new_total_due

Gomez       NaN
Jack        NaN
Morticia    NaN
Sally       NaN
Victor      NaN
Wednesday   NaN
Zero        NaN
dtype: float64

In [16]:
week_five = pd.Series(data = [10, 20, 30, 40], index = ['Ally', 'Bob', 'Coleen', 'Don'])
week_five

Ally      10
Bob       20
Coleen    30
Don       40
dtype: int64

In [17]:
week_six = pd.Series(data = [30, 40, 50], index = ['Ally', 'Bob', 'Coleen'] )
week_six

Ally      30
Bob       40
Coleen    50
dtype: int64

In [18]:
new_total_due_2 = week_five + week_six
new_total_due_2

Ally      40.0
Bob       60.0
Coleen    80.0
Don        NaN
dtype: float64

Notice how the operator (+ in this case) was applied along the corresponding labels.

Awesome! Let's now move on to talk about pandas DataFrames, which builds off of the Series and is what we'll be using most throughtout the course.
<br>

## DataFrames

Formally, a DataFrame is 2-dimensional labeled data structure with columns of potentially different types. It's probably easiest to think of DataFrames as many Series placed next to each other to share a common index label, but you can also think of them as spreadsheets, SQL tables, or a dictionary of Series objects.

We create a DataFrame using **pd.DataFrame(data, index, columns).data** and **index** are pretty familiar to us now that we've seen Series, but what is this new **columns** parameter? Well, if you think of DataFramesare many Series placed next to each other to share a common index label, we need some way of accessing each individual Series, This is where **columns** come in. You can think of it as additional labels for each individual Series/column. Let's see an example below.

In [19]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ['A', 'B', 'C', 'D'], 
                     columns = ['col1', 'col2', 'col3', 'col4', 'col5'])

print(my_df)
print(type(my_df))

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
<class 'pandas.core.frame.DataFrame'>

Notice the type of what's returned when we access 'col2'. A Series 😲�, which shouldn't come as too much of a surprise since we mentioned that DataFrames can be thought of as these individula Series placed next to each other to share a common index label.

In [20]:
print(my_df['col2'])
print(type(my_df['col2']))

A     1
B     6
C    11
D    16
Name: col2, dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
print(my_df['col4'])
print(type(my_df['col4']))

A     3
B     8
C    13
D    18
Name: col4, dtype: int64
<class 'pandas.core.series.Series'>

In [22]:
print(my_df['col4'])
print(type('col4')) # interesting a col by itself is considered a 'str' type 🧐

A     3
B     8
C    13
D    18
Name: col4, dtype: int64
<class 'str'>

**Note: As mentioned in the Series section, DataFrame index labels will also default to [0, n) if not specified. For example:**

In [23]:
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), columns=['col1','col2','col3','col4','col5']) 
my_df

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     5     6     7     8     9
2    10    11    12    13    14
3    15    16    17    18    19

Also, DataFrames will display a lot nicer in jupyter notebooks if you don't call print() on them. 😊

Let's now see how we can access data from these DataFrames.

## DataFrames: Selection

In [24]:
my_df = pd.DataFrame(data = np.arange(0, 20).reshape(4, 5), index = ['A', 'B', 'C', 'D'],
                        columns = ['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

We can access individual columsn using the column names/labels we specified.

In [25]:
my_df['col2']

A     1
B     6
C    11
D    16
Name: col2, dtype: int64

In [26]:
my_df['col4']

A     3
B     8
C    13
D    18
Name: col4, dtype: int64

In [27]:
my_df['col5']

A     4
B     9
C    14
D    19
Name: col5, dtype: int64

We can access multiple columns by specifying a list of the column names that we'd like to retrieve.

In [28]:
my_df[['col2', 'col3']]

   col2  col3
A     1     2
B     6     7
C    11    12
D    16    17

In [29]:
my_df[['col3', 'col5']]

   col3  col5
A     2     4
B     7     9
C    12    14
D    17    19

What if we'd like to access row information? We can specify the index location using **.iloc**, or the index name/label using **.loc**

In [30]:
my_df.iloc[0] # this will return row 0 in vertical format!

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [31]:
my_df.iloc[2]

col1    10
col2    11
col3    12
col4    13
col5    14
Name: C, dtype: int64

In [32]:
my_df.iloc[3]

col1    15
col2    16
col3    17
col4    18
col5    19
Name: D, dtype: int64

In [33]:
my_df.loc['A']

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [34]:
my_df.loc['C']

col1    10
col2    11
col3    12
col4    13
col5    14
Name: C, dtype: int64

We can grab a section using **[start_index:stop_index]**. stop_index is not inclusive when using index locations. This should look familiar to how we accessed elements in Numpy arrays.

In [35]:
my_df.iloc[0:3]

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [36]:
my_df.loc['A':'C']

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [37]:
my_df.iloc[1:3]

   col1  col2  col3  col4  col5
B     5     6     7     8     9
C    10    11    12    13    14

In [38]:
my_df.loc['B': 'D']

   col1  col2  col3  col4  col5
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

For a section of both rows and columns, we must specify both the row sections of interest and columns sections of interest. This should also look familar to how we accessed row and column sections of interest from 2d Numpy arrays, except we now have to use **.iloc** or **.loc** depending on how we'd like to specify the rows (by index position or index label/name)

In [39]:
my_df.iloc[1:4, 0:3] # [rows, cols]

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [40]:
my_df.iloc[2:4, 0:3]

   col1  col2  col3
C    10    11    12
D    15    16    17

In [41]:
my_df.loc['B':'D', 'col1':'col3']

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

Recall how we were able to select elements from a Numpy array based off of some condition. The same can be done with DataFrames since our data is essentially just a Numpy array. Let's see a quick example.

In [42]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ['A', 'B', 'C', 'D'], 
                        columns = ['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

Using comparison operators with our DataFrame, we get back a DataFrame with True/False values indicating whether the value at that position satisfoed the condition.

In [43]:
my_df%2 == 0 # this will return true for all even entry!

    col1   col2   col3   col4   col5
A   True  False   True  False   True
B  False   True  False   True  False
C   True  False   True  False   True
D  False   True  False   True  False

In [42]:
my_df%2 != 0 # this will return true for all odd entry!

    col1   col2   col3   col4   col5
A  False   True  False   True  False
B   True  False   True  False   True
C  False   True  False   True  False
D   True  False   True  False   True

So as we saw with Numpy arrays, we can specify this condition as what we would like to select. We'll then get back only the values that met the condition. Those that did not meet the condition will get replaced with NaN representing a missing or empty value.

In [43]:
my_df[my_df % 2 == 0] # empty even cells

   col1  col2  col3  col4  col5
A   0.0   NaN   2.0   NaN   4.0
B   NaN   6.0   NaN   8.0   NaN
C  10.0   NaN  12.0   NaN  14.0
D   NaN  16.0   NaN  18.0   NaN

In [44]:
my_df[my_df % 2 != 0] # empty odd cells

   col1  col2  col3  col4  col5
A   NaN   1.0   NaN   3.0   NaN
B   5.0   NaN   7.0   NaN   9.0
C   NaN  11.0   NaN  13.0   NaN
D  15.0   NaN  17.0   NaN  19.0

We'll late learn how to properly take care of these NaN values, but we can fill them all  with a certain value using fillna(value). For example:

In [45]:
# filling all NaN values with 0 
my_df[my_df % 2 == 0].fillna(value=0) # notice the .fillna(value)

   col1  col2  col3  col4  col5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0

In [46]:
# filling all NaN values with whatever the mean of my_df's original col2 is: (1+6+11+16)/4 = 8.5
my_df[my_df % 2 == 0].fillna(value = my_df['col2'].mean()) # this will come in handy when performing imputation!

   col1  col2  col3  col4  col5
A   0.0   8.5   2.0   8.5   4.0
B   8.5   6.0   8.5   8.0   8.5
C  10.0   8.5  12.0   8.5  14.0
D   8.5  16.0   8.5  18.0   8.5

### DataFrames: Adding and Dropping Columns

In [47]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

We can create new columns in DataFrame by either passing in the new data we would like to store there, or from existing columns/features in our DataFrame. Let's see an example of noth cases below.

In [48]:
my_df['newCol'] = [10, 20, 30, 40]
my_df

   col1  col2  col3  col4  col5  newCol
A     0     1     2     3     4      10
B     5     6     7     8     9      20
C    10    11    12    13    14      30
D    15    16    17    18    19      40

In [49]:
my_df['col1+col2'] = my_df['col1'] + my_df['col2'] # adds the vals from r1 and r2 and assigns them to a new col
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2
A     0     1     2     3     4      10          1
B     5     6     7     8     9      20         11
C    10    11    12    13    14      30         21
D    15    16    17    18    19      40         31

In [50]:
my_df['col2 plus col4'] = my_df['col2'] + my_df['col4']
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2  col2 plus col4
A     0     1     2     3     4      10          1               4
B     5     6     7     8     9      20         11              14
C    10    11    12    13    14      30         21              24
D    15    16    17    18    19      40         31              34

In [51]:
my_df['new new col'] = [100, 200, 300, 400]
my_df

,col1,col2,col3,col4,col5,newCol,col1+col2,col2 plus col4,new new col
A,0,1,2,3,4,10,1,4,100
B,5,6,7,8,9,20,11,14,200
C,10,11,12,13,14,30,21,24,300
D,15,16,17,18,19,40,31,34,400

What if we want to drop/remove certain column(s)? We can acomplish this using **drop(columns).**

In [52]:
my_df.drop(columns = ['newCol'])

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4  new new col
A     0     1     2     3     4          1               4          100
B     5     6     7     8     9         11              14          200
C    10    11    12    13    14         21              24          300
D    15    16    17    18    19         31              34          400

In [53]:
my_df.drop(columns = ['new new col'])

   col1  col2  col3  col4  col5  newCol  col1+col2  col2 plus col4
A     0     1     2     3     4      10          1               4
B     5     6     7     8     9      20         11              14
C    10    11    12    13    14      30         21              24
D    15    16    17    18    19      40         31              34

Note that these changes are not done inplace. This means that these changes are not pemanent. We can see this if we print my_df again.

In [54]:
my_df

,col1,col2,col3,col4,col5,newCol,col1+col2,col2 plus col4,new new col
A,0,1,2,3,4,10,1,4,100
B,5,6,7,8,9,20,11,14,200
C,10,11,12,13,14,30,21,24,300
D,15,16,17,18,19,40,31,34,400

To make these changes permanent, we can supply an additional parameter **inplace = True**

In [55]:
my_df.drop(columns = ['newCol', 'new new col'], inplace = True)

Now if we print my_df again we can see that the changes were saved. Keep this in mind when you want to modify the original DataFrame.

In [56]:
my_df

   col1  col2  col3  col4  col5  col1+col2  col2 plus col4
A     0     1     2     3     4          1               4
B     5     6     7     8     9         11              14
C    10    11    12    13    14         21              24
D    15    16    17    18    19         31              34

## DataFrames: Groupby and Common Operations

In [57]:
my_df = pd.DataFrame({'Type': ['Falcon','Falcon','Parrot','Parrot','Cat','Cat','Cat'],
                      'Max Speed': [380., 370., 24., 26., 50., 50., 150.]})
my_df

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

In [58]:
my_df2 = pd.DataFrame({'Type': ['Apple','Blueberry','Apple','Carrot','Peach','Mango','Guava'],
                      'Max Price': [3., 5., 5., 2., 5., 10., 5.]})
my_df2

        Type  Max Price
0      Apple        3.0
1  Blueberry        5.0
2      Apple        5.0
3     Carrot        2.0
4      Peach        5.0
5      Mango       10.0
6      Guava        5.0

We'll use this small DataFrame to demonstrate some common operations and useful functions that we can perform on DataFrames.**my_df** has 7 observations (0-6) of animals. For each animal, we recorded the type of animal that they are, and their max speed.

Something we'll often like to know is how many unique values are in a certain column. We can achieve this by calling **unique()** on our column of interest.

In [59]:
print(f"unique types: {my_df['Type'].unique()}")
print(f"unique max speeds: {my_df['Max Speed'].unique()}")

unique types: ['Falcon' 'Parrot' 'Cat']
unique max speeds: [380. 370.  24.  26.  50. 150.]

In [60]:
print(f"unique types: {my_df2['Type'].unique()}")
print(f"unique max speeds: {my_df2['Max Price'].unique()}")

unique types: ['Apple' 'Blueberry' 'Carrot' 'Peach' 'Mango' 'Guava']
unique max speeds: [ 3.  5.  2. 10.]

What if we'd like to also know how many of each unique type there are? This can be done by instead calling **value_counts()**. This will not only tell us how many unique values there are in the column(cat, parrot, and falcon in this case), but also how many of that type we have(3 cats, 2 parrots, and 2 falcons in the this DataFrame).

In [61]:
my_df['Type'].value_counts()

Type
Cat       3
Falcon    2
Parrot    2
Name: count, dtype: int64

In [62]:
my_df2['Type'].value_counts()

Type
Apple        2
Blueberry    1
Carrot       1
Peach        1
Mango        1
Guava        1
Name: count, dtype: int64

We can also do things like get the sum, mean, min, or max of a column:

In [63]:
print(f"The sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"The mean of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"The min of Max Speed col: {my_df['Max Speed'].min()}")
print(f"The max of Max Speed col: {my_df['Max Speed'].max()}")

The sum of Max Speed col: 1050.0
The mean of Max Speed col: 150.0
The min of Max Speed col: 24.0
The max of Max Speed col: 380.0

In [64]:
print(f"The sum of Max Price col: {my_df2['Max Price'].sum()}")
print(f"The mean of Max Price col: {my_df2['Max Price'].mean()}")
print(f"The min of Max Price col: {my_df2['Max Price'].min()}")
print(f"The max of Max Price col: {my_df2['Max Price'].max()}")

The sum of Max Price col: 35.0
The mean of Max Price col: 5.0
The min of Max Price col: 2.0
The max of Max Price col: 10.0

What if we wanted to know the mean Max Speed for each group of animals? This is where a function called **groupby(by)** will come in handy. This will group all common types and the allow us to apply a function like mean to each group. For example:

In [65]:
# This grouped all cats together, all falcons together, all parrots together and then applied the mean function
# to each groups columns (only Max Speed in this case). So we can see that the mean Max Speed for all cats is 
# DataFrame is 83.333333.
my_df.groupby(by='Type').mean()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000

In [66]:
my_df2.groupby(by='Type').mean()

           Max Price
Type
Apple            4.0
Blueberry        5.0
Carrot           2.0
Guava            5.0
Mango           10.0
Peach            5.0

**Note that here we grouped by the 'Type' column, but we could specify a different column if we wanted to. Just make sure that you group by something that makes sense.**

### Extra Practice

Great! now let's use what we've learned to explore a real dataset using pandas.

We'll be looking at a [pokemon dataset](https://www.kaggle.com/datasets/abcsds/pokemon), which contains the following attributes:

* #: ID for each pokemon 
* Name: Name of each pokemon
* Type 1: Each pokemon has a type, this determines weakness/resistance to attacks
* Type 2: Some pokemon are dual type and have 2
* Total: sum of all stats that come after this, a general guide to how strong a pokemon is 
* HP: hit points, or health, defines how much damage a pokemon can withstand before fainting 
* Attack: the base modifier for normal attacks (eg. Scratch, Punch)
* Defense: the base damage resistance against normal attacks
* SP Atk: special attack, the base modifier for a special attacks (e.g. fire blast, bubble beam) 
* SP Def: the base damage resistance against special attacks
* Speed: determines which pokemon attacks first each round

We'll typically be reading in an existing dataset from our computer, which pandas will then convert into a beautiful DataFrame for us rather than having to create the whole thing from scratch like we did in this lab. To do this, we'll use **pd.read_csv(filepath_or_buffer)**. If dataset is located in the same directory as this jupyter notebook, we can simply provide the name of the dataset file into the **filepaht_or_buffer parameter**. Otherwise we'll have to specify the path to this file.

In [67]:
pokemon_df = pd.read_csv(filepath_or_buffer = 'Pokemon.csv')

After reading, we can get a preview of this dataset using **head()**. This will show us the first 5 values in the dataset by default, but you can specify more or less inside the paranthesis.

In [68]:
pokemon_df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

We can then print a concise summary of our pokemon DataFrame using **info()**. The info below lets us know that we have 800 entries, and how many non-null values are in each feature/column. Since the Type 2 column only contains 412 non-null values, there 386 missing values in this column. We'll want to take care of this since we don't like to have missing values.

In [69]:
pokemon_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

As you'll learn in lecture, there are many ways to handle missing data. I'll list some options down below for both categorical and quantitive variables.

Some options for **categorical** variables include:

* Remove observations with missing values if we are dealing with a large dataset and the number of records containing missing values are few. 
* Remove the variable/column if it is not significant. 
* Develop a model to predict missing values. KNN for example. 
* Replace missing values witht the most frequent in that column.

**Note There is not one single method that will work for ever every case. Determining how you'll handle missing data will vary between datasets.**

Here we will keep it simple and fill missing values with their corresponding Type 1 value, but we'll see some of the other methods in later labs.

In [70]:
pokemon_df['Type 2'].fillna(pokemon_df['Type 1'], inplace = True)

After filling missing Type 2 values, we can call **info()** again and see that there are no longer any missing values. This dataset contains a total of 800 entries, and there are 800 non-null values in every column.

In [71]:
pokemon_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      800 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

Recall how we were able to select observations from a DataFrame based off of some conditional. Let's use this to see how many legendary pokemon are in this dataset.

In [72]:
pokemon_df[pokemon_df['Legendary'] == True]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
156,144,Articuno,Ice,Flying,580,90,85,100,95,125,85,1,True
157,145,Zapdos,Electric,Flying,580,90,90,85,125,90,100,1,True
158,146,Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
162,150,Mewtwo,Psychic,Psychic,680,106,110,90,154,90,130,1,True
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,780,106,190,100,154,100,130,1,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

65 rows x 13 columns tells is that there are 65 legendary pokemon in this dataset. Note that you could also retrive this information as a tuple by calling **shape** off of this DataFrame. For example:

In [73]:
pokemon_df[pokemon_df['Legendary'] == True].shape

(65, 13)

In [74]:
electric_pokemon = pokemon_df[pokemon_df['Type 1'] == 'Electric']

electric_pokemon_shape = electric_pokemon.shape

print(electric_pokemon_shape)

(44, 13)

In [75]:
electric_pokemon = pokemon_df[pokemon_df['Type 2'] == 'Ghost']

electric_pokemon_shape = electric_pokemon.shape

print(electric_pokemon_shape)

(24, 13)

Try to see if you can figure out how many pokemon of type fire there are.

In [76]:
pokemon_df[pokemon_df['Type 1'] == 'Fire'].shape

(52, 13)

In [77]:
pokemon_df[pokemon_df['Type 2'] == 'Psychic'].shape

(71, 13)

How about if we'd like to find the pokemon with max HP? Well, there are multiple ways to do this. One way is by using **idxmax()**, which will tell us the index location of the max calue in the columnn of interest, and we can then use this information to index the DataFrame.

In [78]:
pokemon_df['HP'].idxmax()

261

In [79]:
pokemon_df['Speed'].idxmax()

431

In [80]:
pokemon_df.iloc[pokemon_df['HP'].idxmax()]

#                 242
Name          Blissey
Type 1         Normal
Type 2         Normal
Total             540
HP                255
Attack             10
Defense            10
Sp. Atk            75
Sp. Def           135
Speed              55
Generation          2
Legendary       False
Name: 261, dtype: object

In [81]:
pokemon_df.iloc[pokemon_df['Defense'].idxmax()]

#                             208
Name          SteelixMega Steelix
Type 1                      Steel
Type 2                     Ground
Total                         610
HP                             75
Attack                        125
Defense                       230
Sp. Atk                        55
Sp. Def                        95
Speed                          30
Generation                      2
Legendary                   False
Name: 224, dtype: object

An alternative method is to use **sort_values(by)** to sort the DataFrame by 'HP' and using **head(1)** to only display to top observation.

In [82]:
pokemon_df.sort_values(by = 'HP', ascending = False).head(1)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
261,242,Blissey,Normal,Normal,540,255,10,10,75,135,55,2,False

In [83]:
pokemon_df.sort_values(by = 'Sp. Atk', ascending = False).head(1)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
164,150,MewtwoMega Mewtwo Y,Psychic,Psychic,780,106,150,70,194,120,140,1,True

As you can see, there will often be more than one to do things in this course. (:

Now see if you can figure out how many each unique Type 1 pokemon there are.

In [84]:
pokemon_df['Type 1'].value_counts()

Type 1
Water       112
Normal       98
Grass        70
Bug          69
Psychic      57
Fire         52
Electric     44
Rock         44
Dragon       32
Ground       32
Ghost        32
Dark         31
Poison       28
Steel        27
Fighting     27
Ice          24
Fairy        17
Flying        4
Name: count, dtype: int64

In [85]:
pokemon_df['Type 2'].value_counts()

Type 2
Flying      99
Water       73
Psychic     71
Normal      65
Grass       58
Poison      49
Ground      48
Fighting    46
Fire        40
Fairy       38
Electric    33
Dark        30
Dragon      29
Steel       27
Ice         27
Ghost       24
Rock        23
Bug         20
Name: count, dtype: int64

Last challenge. See if you can find out what the mean HP is for each of the Type 1 groups above. Hint: refer abck to the groupby section of this lab.

In [86]:
# select only numeric columns
numeric_columns = pokemon_df.select_dtypes(include='number')

# include 'Type 1' for grouping
numeric_columns['Type 1'] = pokemon_df['Type 1']

# group by 'Type 1' and calculate the mean for numeric columns
mean_hp_by_type = numeric_columns.groupby('Type 1').mean()['HP']

# displaying the result
print(mean_hp_by_type)

Type 1
Bug         56.884058
Dark        66.806452
Dragon      83.312500
Electric    59.795455
Fairy       74.117647
Fighting    69.851852
Fire        69.903846
Flying      70.750000
Ghost       64.437500
Grass       67.271429
Ground      73.781250
Ice         72.000000
Normal      77.275510
Poison      67.250000
Psychic     70.631579
Rock        65.363636
Steel       65.222222
Water       72.062500
Name: HP, dtype: float64